// Тема урока: Классы и объекты

// Класс — это шаблон, который позволяет описать в программе объект
// Согласно java конвенции имя класса должно начинаться с большой буквы.
// В java-файле может быть только один класс с модификатором public. Он главный в java-файле
// Имя класса с модификатором public должно совпадать с названием java-файла

package Lesson14;

public class Lesson14 {
    public static void main(String[] args) {

        // Объект - экземпляр класса.
        // Создание объекта класса происходит следующим образом:
        // тип_объекта имя_объекта = new имя_класса();
        Cat cat = new Cat();

        // Присвоение значений полям класса.
        // Обычно так не делают, потому что нарушается принцип инкапсуляции.
        cat.name = "Геральт";
        cat.age = 2;

        // Вызов метода на объекте.
        cat.speak();
    }
}

// У класса могут быть:
// 1. Данные (поля)
// 2. Действия (методы)

class Cat {
    // Поля класса.
    String name;
    int age;

    // Метод класса.
    void speak() {
        System.out.println(name + ", " + age);
    }
}