// Тема урока: Абстрактные классы


package Lesson41;

// Класс Animal не является сущностью, он является концепцией, поэтому его можно рассматривать как абстрактный класс.
// Для создания абстрактного класса необходимо указать ключевое слово abstract.
// Класс является абстрактным, если хотя бы один из его методов является абстрактным.

public abstract class Animal {

    // Как и любой другой класс, абстрактный класс может иметь конструктор, но вызвать его можно только у наследника.
    public Animal() {
        System.out.println("Конструктор из абстрактного класса Animal");
    }

    // Класс является абстрактным, если хотя бы один из его методов является абстрактным.
    // Абстрактные методы имеют только сигнатуру, но не имеют реализации.
    public abstract void voice();
}
