// Тема урока: Абстрактные классы

// Абстрактный класс - это класс, который служит основой для других классов.
// Такой класс не предполагает создания экземпляров, но от него можно наследоваться.

// Не стоит путать абстрактный класс с интерфейсом!
// Интерфейс - контракт, который описывает поведение класса. У него нет состояния.
// А абстрактный класс имеет и поведение, и состояние.

package Lesson41;

public class Lesson41 {
    public static void main(String[] args) {
        Cat cat = new Cat();
        cat.voice();
    }
}
