// Тема урока: Рекурсия

// Рекурсия - возможность вызова функции внутри самой функции.

// Для рекурсивной функции есть два основных требования:
// 1. Условие остановки - функция возвращает значение при выполнении условия без дальнейшего рекурсивного вызова.
// 2. Рекурсивный вызов - функция вызывает себя с параметром, который на шаг ближе к условию остановки.

// Каждый рекурсивный вызов будет добавлен в память стека Java.
// Если погружение рекурсии слишком глубокое, может возникнуть переполнение стека (StackOverflowError).


package Lesson49;

public class Lesson49 {
    public static void main(String[] args) {
        System.out.println(fact(4));
    }

    // Рекурсивная функция для вычисления факториала.
    private static int fact(int n) {
        if (n == 0 | n == 1) { // условие остановки
            return 1;
        }
        return n * fact(n - 1); // рекурсивный вызов
    }

    /*
     * Рекурсивные вызовы:
     * fact(4)  ->
     * fact(3)  ->
     * fact(2)  ->
     * fact(1)  ->
     * stop, return = 1.

     * Возврат из рекурсивных вызовов:
     * fact(2), return = 2 * 1 = 2  ->
     * fact(3), return = 3 * 2 = 6  ->
     * fact(4), return = 4 * 6 = 24.
     */
}
