// Тема урока: Интерфейсы

// Если класс реализует какой-то интерфейс, это значит, что он обязать иметь методы, которые указаны в интерфейсе.

package Lesson26;

public class Lesson26 {
    public static void main(String[] args) {

        // Тип может не совпадать с классом.
        // Такое возможно, если класс реализует интерфейс.
        Info info1 = new Cat("Барсик");
        Info info2 = new Fish("разноцветная");

        // В таком случае есть доступ к методам интерфейса, но нет доступа к методам класса.
        info1.showInfo();
        info2.showInfo();

        // Можно создавать объекты самого класса, но в дальнейшем использовать их для вызова методов интерфейса.
        Cat cat = new Cat("Геральт");
        Fish fish = new Fish("золотая");

        // В качестве аргумета можно подать объект класса, который реализуют интерфейс.
        printInfo(cat);
        printInfo(fish);
    }

    // Метод принимает объект, который реализует интерфейс.
    // В методе можно вызвать только те методы, которые реализует интерфейс.
    public static void printInfo(Info info) {
        info.showInfo();
    }
}
