// Тема урока: Анонимные классы

// Анонимный класс - класс без имени, который имеет только один экземпляр.
// Анонимные классы нужны для реализации интерфейса или расширения существующего класса.

package Lesson35;

interface AnimalAction {
    public void voice ();
}

public class Lesson35 {
    public static void main(String[] args) {

        // Что происходит в Java-машине при реализации интерфейса с использованием анонимного класса?
        // 1. Создается безымянный Java-класс, реализующий интерфейс AnimalAction.
        // 2. Компилятор требует реализовать все методы интерфейса AnimalAction.
        // 3. Создается один объект этого класса.

        // Анонимный класс не имеет конструкторов.
        // Анонимный класс может иметь только переменные final.
        // Анонимный класс не имеет статических переменных и методов.

        AnimalAction cat = new AnimalAction() {
            @Override
            public void voice() {
                System.out.println("Мяу");
            }
        };
        cat.voice();
    }
}
