// Тема урока: Классы-обертки примитивных типов данных

// Примитивы в программировании занимают мало памяти, из-за чего повышается эффективность программы.
// Существенным недостатком примитивов является отсутствие методов, но это можно исправить, используя классы-обертки.
// Классы-обертки для примитивов: Float, Double, Byte, Short, Integer, Long, Character, Boolean.
// Объекты классов-оберток являются неизменяемыми (Immutable)

package Lesson31;

public class Lesson31 {
    public static void main(String[] args) {

        // Автоупаковка (autoboxing) - присваивание переменной класса-обертки значение примитивного типа.
        Integer i = 123;

        // Автораспаковка (autounboxing) - присваивание переменной примитивного типа объекта класса-обертки
        int x = i;

        // Использование класса-обертки Integer для преобразования числа в строку.
        Integer x1 = 123;
        String s1 = x1.toString();

        // Аналогичным образом можно преобразовать строку в число.
        String s2 = "321";
        Integer x2 = Integer.parseInt(s2);
    }
}
